"""
Organizing the code.
1. Main app file.
    /app.py, run_service.py/
    Ціль цього файлу підготувати і запустити головні методи класів,
        які забезпечують роботу програми.
1.2. поруч можуть бути:
    requirements.txt
    settings.py
    constant.py
    .config files
2. "Головні класи" - шар бізнес-логіки.
    Виконують основну роботу програми - керують "робочими" класами
3. "Робочі класи" - класи, які безпосереднбо виконують певну
    специфічну задачу.

    1
 *2, 2*
3 3 3 3
API, DB, 3rd party libraries.
"""